#!/usr/bin/python
# -*- coding: UTF-8 -*-

import numpy as np

# create array
a1 = np.array((1, 2, 3, 4, 5))# 参数是元组
a2 = np.array([6, 7, 8, 9, 0])# 参数是list
a3 = np.array([[1, 2, 3], [4, 5, 6]])# 参数二维数组
print(a1, a2, a3)
print(a3.shape)#得到c的形状是2行3列

a4 = np.array([[1, 2], [3, 4], [5, 6]])#创建3行2列二维数组。

a5 = np.zeros(6)#创建长度为6的，元素都是0一维数组
a6 = np.zeros((2,3))#创建3行2列，元素都是0的二维数组
a7 = np.ones((2,3))#创建3行2列，元素都是1的二维数组
a8 = np.empty((2,3)) #创建3行2列,未初始化的二维数组
a9 = np.arange(6)#创建长度为6的，一维数组array([0, 1, 2, 3, 4, 5])
a10 = np.arange(1,7,2)#结果与np.arange(6)一样。第一，二个参数意思是数值从1〜6,不包括7.第三个参数表步长为2
a11 = np.linspace(0,10,7) # 生成首位是0，末位是10，含7个数的等差数列
a12 = np.logspace(0,4,5)#用于生成首位是10**0，末位是10**4，含5个数的等比数列
print(a8, a9, a10, a11)
print("..........................................分割线...................................................")
# add
b1 = np.array([[1, 2], [3, 4], [5, 6]])
b2 = np.array([[10, 20], [30, 40], [50, 60]])

b3 = np.append(b1, 7)
b4 = np.append(b1, b2)
print(b3)
print(b4)
b5 = np.vstack((b1, b2))
b6 = np.hstack((b1, b2))
print(b5)
print(b6)
print("..........................................分割线...................................................")
# search
c1 = np.array([[1, 2], [3, 4], [5, 6]])
print(c1[0])# array([1, 2])
print(c1[0][1])#2
print(c1[0, 1])#2
c2 = np.arange(6)#array([0, 1, 2, 3, 4, 5])
print(c2[1:3])#右边开区间,array([1, 2])
print(c2[:3])#左边默认为0,array([0, 1, 2])
print(c2[3:])#右边默认为元素个数,array([3, 4, 5])
print(c2[0:4:2])#下标递增2,array([0, 2])
print("..........................................分割线...................................................")
# modify

print("..........................................分割线...................................................")
# delete

print("..........................................分割线...................................................")
# traversal


